notes/nov1/nov1.html
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org56595ec">1. First-order logic</a></li>
<li><a href="#org116cf02">2. Rules</a>
<ul>
<li><a href="#org802f155">2.1. Conjunction rules</a></li>
<li><a href="#orge0a2b22">2.2. Disjunction rules</a></li>
<li><a href="#orgb14c20a">2.3. Negation rules</a></li>
<li><a href="#org4317f3b">2.4. γ rules</a></li>
<li><a href="#org040cce0">2.5. δ rules</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org56595ec" class="outline-2">
<h2 id="org56595ec"><span class="section-number-2">1.</span> First-order logic</h2>
<div class="outline-text-2" id="text-1">
<p>
We start by declaring data types for <i>terms</i>; i.e., variables and names.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Var</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Int</span> <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Eq</span>, <span style="color: #d3869b;">Ord</span>, <span style="color: #d3869b;">Show</span>)
<span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Name</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Name</span> <span style="color: #d3869b;">Int</span> <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Eq</span>, <span style="color: #d3869b;">Ord</span>, <span style="color: #d3869b;">Show</span>)
</pre>
</div>
<p>
Note the derived <a href="https://hackage.haskell.org/package/base-4.19.0.0/docs/Data-Ord.html"><code>Ord</code></a> instances. We'll make use of these later on: we'll use
the instance for <code>Var</code> to obtain fresh variables when doing substitution on FOL
formulae, and we'll use the instance for <code>Name</code> to obtain fresh names when we
implement the γ and δ tableau rules.
</p>

<p>
A more general data type <code>Term</code> encodes those expressions that can occur as
arguments to an FOL predicate.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Term</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">V</span> <span style="color: #d3869b;">Var</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">N</span> <span style="color: #d3869b;">Name</span> <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Eq</span>, <span style="color: #d3869b;">Show</span>)
</pre>
</div>

<p>
We can encode the full set of formulae as:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Form</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">P</span> <span style="color: #d3869b;">Integer</span> [<span style="color: #d3869b;">Term</span>]
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">And</span> <span style="color: #d3869b;">Form</span> <span style="color: #d3869b;">Form</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Or</span> <span style="color: #d3869b;">Form</span> <span style="color: #d3869b;">Form</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Not</span> <span style="color: #d3869b;">Form</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Forall</span> <span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Form</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Exists</span> <span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Form</span> <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>)
</pre>
</div>
<p>
Note that the arguments of a predicate are encoded simply as a list; e.g.,
\(P_1(v_2)\), we encode as <code>P 1 [V (Var 0)]</code>; \(P_2(v_0, n_1)\), we encode as <code>P 2 [V
  (Var 0), N (Name 1)]</code>; \(P_0\) (the atomic proposition which takes no arguments),
we encode as <code>P 0 []</code>; etc.
</p>

<p>
To define <i>equality</i> on propositions, we really only care about α-equivalence;
i.e., we don't care about exact equality, but equality up to the renaming of
bound variables. We can define this notion of equality as follows, in terms of
an <code>Eq</code> instance:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Eq</span> <span style="color: #d3869b;">Form</span> <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">P</span> i ts0 <span style="color: #83a598;">==</span> <span style="color: #d3869b;">P</span> j ts1 <span style="color: #83a598;">=</span> i <span style="color: #83a598;">==</span> j <span style="color: #83a598;">&amp;&amp;</span> ts0 <span style="color: #83a598;">==</span> t1
  <span style="color: #d3869b;">And</span> f0 f1 <span style="color: #83a598;">==</span> <span style="color: #d3869b;">And</span> f2 f3 <span style="color: #83a598;">=</span> f0 <span style="color: #83a598;">==</span> f2 <span style="color: #83a598;">&amp;&amp;</span> f1 <span style="color: #83a598;">==</span> f3
  <span style="color: #d3869b;">Or</span> f0 f1 <span style="color: #83a598;">==</span> <span style="color: #d3869b;">Or</span> f2 f3 <span style="color: #83a598;">=</span> f0 <span style="color: #83a598;">==</span> f2 <span style="color: #83a598;">&amp;&amp;</span> f1 <span style="color: #83a598;">==</span> f3
  <span style="color: #d3869b;">Not</span> f0 <span style="color: #83a598;">==</span> <span style="color: #d3869b;">Not</span> f1 <span style="color: #83a598;">=</span> f0 <span style="color: #83a598;">==</span> f1
  <span style="color: #d3869b;">Forall</span> v0 f0 <span style="color: #83a598;">==</span> <span style="color: #d3869b;">Forall</span> v1 f1 <span style="color: #83a598;">=</span> f0new <span style="color: #83a598;">==</span> f1new
    <span style="color: #fb4933;">where</span> vnew <span style="color: #83a598;">=</span> freshV (fv f0 <span style="color: #83a598;">++</span> fv f1)
          f0new <span style="color: #83a598;">=</span> subst v0 (<span style="color: #d3869b;">V</span> vnew) f0
          f1new <span style="color: #83a598;">=</span> subst v1 (<span style="color: #d3869b;">V</span> vnew) f1
  <span style="color: #d3869b;">Exists</span> v0 f0 <span style="color: #83a598;">==</span> <span style="color: #d3869b;">Exists</span> v1 f1 <span style="color: #83a598;">=</span> f0new <span style="color: #83a598;">==</span> f1new
    <span style="color: #fb4933;">where</span> vnew <span style="color: #83a598;">=</span> freshV (fv f0 <span style="color: #83a598;">++</span> fv f1)
          f0new <span style="color: #83a598;">=</span> subst v0 (<span style="color: #d3869b;">V</span> vnew) f0
          f1new <span style="color: #83a598;">=</span> subst v1 (<span style="color: #d3869b;">V</span> vnew) f1
  <span style="color: #fb4933;">_</span> <span style="color: #83a598;">==</span> <span style="color: #fb4933;">_</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">False</span>
</pre>
</div>
<p>
To define notions like <i>fresh variable</i>, we can declare a class <code>Attributes</code>
containing methods for representing attributes of an expression in which we
might be interested. For our purposes, we care about extracting the free
variables and the names contained within some expression. We may then use
these attributes to obtain fresh variables and fresh names. 
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Attributes</span> e <span style="color: #fb4933;">where</span>
  fv <span style="color: #83a598;">::</span> e <span style="color: #83a598;">-&gt;</span> [<span style="color: #d3869b;">Var</span>]
  ns <span style="color: #83a598;">::</span> e <span style="color: #83a598;">-&gt;</span> [<span style="color: #d3869b;">Name</span>]

<span style="color: #fabd2f;">freshV</span> <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">Var</span>] <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Var</span>
<span style="color: #fabd2f;">freshV</span> <span style="color: #d3869b;">[]</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> 0
<span style="color: #fabd2f;">freshV</span> l <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> (n <span style="color: #83a598;">+</span> 1)
  <span style="color: #fb4933;">where</span> <span style="color: #d3869b;">Var</span> n <span style="color: #83a598;">=</span> maximum l

<span style="color: #fabd2f;">freshN</span> <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">Name</span>] <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Name</span>
<span style="color: #fabd2f;">freshN</span> <span style="color: #d3869b;">[]</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Name</span> 0
<span style="color: #fabd2f;">freshN</span> l <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Name</span> (n <span style="color: #83a598;">+</span> 1)
  <span style="color: #fb4933;">where</span> <span style="color: #d3869b;">Name</span> n <span style="color: #83a598;">=</span> maximum l
</pre>
</div>
<p>
We can implement this class as separate instances for <code>Term</code> and <code>Form</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Attributes</span> <span style="color: #d3869b;">Term</span> <span style="color: #fb4933;">where</span>
  fv (<span style="color: #d3869b;">V</span> v) <span style="color: #83a598;">=</span> [v]
  fv (<span style="color: #d3869b;">N</span> <span style="color: #fb4933;">_</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">[]</span>
  ns (<span style="color: #d3869b;">V</span> <span style="color: #fb4933;">_</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">[]</span>
  ns (<span style="color: #d3869b;">N</span> n) <span style="color: #83a598;">=</span> [n]

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Attributes</span> <span style="color: #d3869b;">Form</span> <span style="color: #fb4933;">where</span>
  fv (<span style="color: #d3869b;">P</span> <span style="color: #fb4933;">_</span> ts) <span style="color: #83a598;">=</span> concatMap fv ts
  fv (<span style="color: #d3869b;">And</span> f0 f1) <span style="color: #83a598;">=</span> fv f0 <span style="color: #83a598;">++</span> fv f1
  fv (<span style="color: #d3869b;">Or</span> f0 f1) <span style="color: #83a598;">=</span> fv f0 <span style="color: #83a598;">++</span> fv f1
  fv (<span style="color: #d3869b;">Not</span> f) <span style="color: #83a598;">=</span> fv f
  fv (<span style="color: #d3869b;">Forall</span> v f) <span style="color: #83a598;">=</span> filter (<span style="color: #83a598;">/=</span> v) (fv f)
  fv (<span style="color: #d3869b;">Exists</span> v f) <span style="color: #83a598;">=</span> filter (<span style="color: #83a598;">/=</span> v) (fv f)

  ns (<span style="color: #d3869b;">P</span> <span style="color: #fb4933;">_</span> ts) <span style="color: #83a598;">=</span> concatMap ns ts
  ns (<span style="color: #d3869b;">And</span> f0 f1) <span style="color: #83a598;">=</span> ns f0 <span style="color: #83a598;">++</span> ns f1
  ns (<span style="color: #d3869b;">Or</span> f0 f1) <span style="color: #83a598;">=</span> ns f0 <span style="color: #83a598;">++</span> ns f1
  ns (<span style="color: #d3869b;">Not</span> f) <span style="color: #83a598;">=</span> ns f
  ns (<span style="color: #d3869b;">Forall</span> v f) <span style="color: #83a598;">=</span> ns f
  ns (<span style="color: #d3869b;">Exists</span> v f) <span style="color: #83a598;">=</span> ns f
</pre>
</div>

<p>
Now that we have all the necessary ingredients, we can implement our
definition of substitution (starting with substitution on terms, followed by
subtitution on formulae)!
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">substTerm</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Var</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span>
<span style="color: #fabd2f;">substTerm</span> v0 t (<span style="color: #d3869b;">V</span> v1) <span style="color: #83a598;">=</span> <span style="color: #fb4933;">if</span> v0 <span style="color: #83a598;">==</span> v1 <span style="color: #fb4933;">then</span> t <span style="color: #fb4933;">else</span> (<span style="color: #d3869b;">V</span> v1)
<span style="color: #fabd2f;">substTerm</span> v0 t n<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">N</span> <span style="color: #fb4933;">_</span>) <span style="color: #83a598;">=</span> n

<span style="color: #fabd2f;">subst</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Var</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Form</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Form</span>
<span style="color: #fabd2f;">subst</span> v0 t (<span style="color: #d3869b;">Pred</span> i ts) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Pred</span> i (map (substTerm v0 t) ts)
<span style="color: #fabd2f;">subst</span> v0 t (<span style="color: #d3869b;">And</span> f0 f1) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">And</span> (subst v0 t f0) (subst v0 t f1)
<span style="color: #fabd2f;">subst</span> v0 t (<span style="color: #d3869b;">Or</span> f0 f1) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Or</span> (subst v0 t f0) (subst v0 t f1)
<span style="color: #fabd2f;">subst</span> v0 t (<span style="color: #d3869b;">Not</span> f) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Not</span> (subst v t f)
<span style="color: #fabd2f;">subst</span> v0 t f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Forall</span> v1 f1) <span style="color: #83a598;">|</span> v1 <span style="color: #83a598;">==</span> v0 <span style="color: #83a598;">=</span> f
<span style="color: #fabd2f;">subst</span> v0 t<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">N</span> <span style="color: #fb4933;">_</span>) (<span style="color: #d3869b;">Forall</span> v1 f) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Forall</span> v1 (subst v0 t f)
<span style="color: #fabd2f;">subst</span> v0 t<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Var</span> v1) (<span style="color: #d3869b;">Forall</span> v2 f) <span style="color: #83a598;">|</span> v2 <span style="color: #83a598;">==</span> v1 <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Forall</span> vnew (subst v0 t fnew)
  <span style="color: #fb4933;">where</span> vnew <span style="color: #83a598;">=</span> fresh (v1 <span style="color: #d3869b;">:</span> fv f)
        fnew <span style="color: #83a598;">=</span> subst v2 (<span style="color: #d3869b;">V</span> vnew) f
<span style="color: #fabd2f;">subst</span> v0 t<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Var</span> v1) (<span style="color: #d3869b;">Exists</span> v2 f) <span style="color: #83a598;">|</span> v2 <span style="color: #83a598;">/=</span> v1 <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Exists</span> v2 (subst v0 t f)
<span style="color: #fabd2f;">subst</span> v0 t f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Exists</span> v1 f1) <span style="color: #83a598;">|</span> v1 <span style="color: #83a598;">==</span> v0 <span style="color: #83a598;">=</span> f
<span style="color: #fabd2f;">subst</span> v0 t<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">N</span> <span style="color: #fb4933;">_</span>) (<span style="color: #d3869b;">Exists</span> v1 f) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Exists</span> v1 (subst v0 t f)
<span style="color: #fabd2f;">subst</span> v0 t<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Var</span> v1) (<span style="color: #d3869b;">Exists</span> v2 f) <span style="color: #83a598;">|</span> v2 <span style="color: #83a598;">==</span> v1 <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Exists</span> vnew (subst v0 t fnew)
  <span style="color: #fb4933;">where</span> vnew <span style="color: #83a598;">=</span> fresh (v1 <span style="color: #d3869b;">:</span> fv f)
        fnew <span style="color: #83a598;">=</span> subst v2 (<span style="color: #d3869b;">V</span> vnew) f
<span style="color: #fabd2f;">subst</span> v0 t<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Var</span> v1) (<span style="color: #d3869b;">Exists</span> v2 f) <span style="color: #83a598;">|</span> v2 <span style="color: #83a598;">/=</span> v1 <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Exists</span> v2 (subst v0 t f)
</pre>
</div>
</div>
</div>
