notes/nov1/nov1.org
* Rules
  Here we implement the [[../oct30/oct30.html#org2214139][rules]] associated with analytic tableaux. Each
  propositional rule will have type
  #+begin_src haskell
    type PropRule = SignedForm -> [Branch]
  #+end_src
  where ~SignedForm~ and ~Branch~ are
  #+begin_src haskell
    type SignedForm = (Form, Bool)
    type Branch = [SignedForm]
  #+end_src
  That is, each rule allows a node of a tableau to branch in some way. Moreover,
  because multiple branches might end up extending from the relevant node, we
  allow each rule to produce a /list/ of branches.

  γ and δ rules have the type
  #+begin_src haskell
    type Rule = Path -> PropRule
  #+end_src
  where ~Path~ (i.e., an entire path from the root to the relevant terminal node)
  is the same as ~Branch~, i.e.,
  #+begin_src haskell
    type Path = [SignedForm]
  #+end_src
  γ and δ rules have this type because, as quantifier rules, they need access to
  the entire path on which they occur, in order to determine which names are
  legit.
  
  Here are our rules.

** Conjunction rules
   #+begin_src haskell
     andRule :: PropRule
     andRule f@(And f0 f1, True) = [[(f0, True), (f1, True), f]]
     andRule f@(And f0 f1, False) = [[(f0, False), f], [(f1, False), f]]
     andRule f = [[f]]
   #+end_src

** Disjunction rules
   #+begin_src haskell
     orRule :: PropRule
     orRule f@(Or f0 f1, True) = [[(f0, True), f], [(f1, True), f]]
     orRule f@(Or f0 f1, False) = [[(f0, False), (f1, False), f]]
     orRule f = [[f]]
   #+end_src

** Negation rules
   #+begin_src haskell
     notRule :: PropRule
     notRule f@(Not f0, b) = [[(f0, not b), f]]
     notRule f = [[f]]
   #+end_src

** γ rules
   #+begin_src haskell
     gammaRule :: Rule
     gammaRule p f@(Forall v0 f0, True) = [[(subst v0 nameT f0, True), f]]
       where nameT = N (name 0)
	       where name i = if (subst v0 (N (Name i)) f0, True) `elem` p
			      then name (i + 1)
			      else Name i
     gammaRule p f@(Exists v0 f0, False) = [[(subst v0 nameF f0, False), f]]
       where nameF = N (name 0)
	       where name i = if (subst v0 (N (Name i)) f0, False) `elem` p
			      then name (i + 1)
			      else Name i
     gammaRule _ f = [[f]]
   #+end_src

** δ rules
   #+begin_src haskell
     deltaRule :: Rule
     deltaRule p f@(Forall v0 f0, False) = [[(subst v0 frshnm f0, False), f]]
       where frshnm = N (freshN (concatMap (ns . fst) p))
     deltaRule p f@(Exists v0 f0, True) = [[(subst v0 frshnm f0, True), f]]
       where frshnm = N (freshN (concatMap (ns . fst) p))
     deltaRule _ f = [[f]]
   #+end_src
