notes/nov1/nov1.html

<div id="outline-container-org116cf02" class="outline-2">
<h2 id="org116cf02"><span class="section-number-2">2.</span> Rules</h2>
<div class="outline-text-2" id="text-2">
<p>
Here we implement the <a href="../oct30/oct30.html#org2214139">rules</a> associated with analytic tableaux. Each
propositional rule will have type
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #d3869b;">PropRule</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">SignedForm</span> <span style="color: #83a598;">-&gt;</span> [<span style="color: #d3869b;">Branch</span>]
</pre>
</div>
<p>
where <code>SignedForm</code> and <code>Branch</code> are
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #d3869b;">SignedForm</span> <span style="color: #83a598;">=</span> (<span style="color: #d3869b;">Form</span>, <span style="color: #d3869b;">Bool</span>)
<span style="color: #fb4933;">type</span> <span style="color: #d3869b;">Branch</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">SignedForm</span>]
</pre>
</div>
<p>
That is, each rule allows a node of a tableau to branch in some way. Moreover,
because multiple branches might end up extending from the relevant node, we
allow each rule to produce a <i>list</i> of branches.
</p>

<p>
γ and δ rules have the type
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #d3869b;">Rule</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Path</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">PropRule</span>
</pre>
</div>
<p>
where <code>Path</code> (i.e., an entire path from the root to the relevant terminal node)
is the same as <code>Branch</code>, i.e.,
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #d3869b;">Path</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">SignedForm</span>]
</pre>
</div>
<p>
γ and δ rules have this type because, as quantifier rules, they need access to
the entire path on which they occur, in order to determine which names are
legit.
</p>

<p>
Here are our rules.
</p>
</div>

<div id="outline-container-org802f155" class="outline-3">
<h3 id="org802f155"><span class="section-number-3">2.1.</span> Conjunction rules</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">andRule</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">PropRule</span>
<span style="color: #fabd2f;">andRule</span> f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">And</span> f0 f1, <span style="color: #d3869b;">True</span>) <span style="color: #83a598;">=</span> [[(f0, <span style="color: #d3869b;">True</span>), (f1, <span style="color: #d3869b;">True</span>), f]]
<span style="color: #fabd2f;">andRule</span> f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">And</span> f0 f1, <span style="color: #d3869b;">False</span>) <span style="color: #83a598;">=</span> [[(f0, <span style="color: #d3869b;">False</span>), f], [(f1, <span style="color: #d3869b;">False</span>), f]]
<span style="color: #fabd2f;">andRule</span> f <span style="color: #83a598;">=</span> [[f]]
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0a2b22" class="outline-3">
<h3 id="orge0a2b22"><span class="section-number-3">2.2.</span> Disjunction rules</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">orRule</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">PropRule</span>
<span style="color: #fabd2f;">orRule</span> f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Or</span> f0 f1, <span style="color: #d3869b;">True</span>) <span style="color: #83a598;">=</span> [[(f0, <span style="color: #d3869b;">True</span>), f], [(f1, <span style="color: #d3869b;">True</span>), f]]
<span style="color: #fabd2f;">orRule</span> f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Or</span> f0 f1, <span style="color: #d3869b;">False</span>) <span style="color: #83a598;">=</span> [[(f0, <span style="color: #d3869b;">False</span>), (f1, <span style="color: #d3869b;">False</span>), f]]
<span style="color: #fabd2f;">orRule</span> f <span style="color: #83a598;">=</span> [[f]]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb14c20a" class="outline-3">
<h3 id="orgb14c20a"><span class="section-number-3">2.3.</span> Negation rules</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">notRule</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">PropRule</span>
<span style="color: #fabd2f;">notRule</span> f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Not</span> f0, b) <span style="color: #83a598;">=</span> [[(f0, not b), f]]
<span style="color: #fabd2f;">notRule</span> f <span style="color: #83a598;">=</span> [[f]]
</pre>
</div>
</div>
</div>

<div id="outline-container-org4317f3b" class="outline-3">
<h3 id="org4317f3b"><span class="section-number-3">2.4.</span> γ rules</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">gammaRule</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Rule</span>
<span style="color: #fabd2f;">gammaRule</span> p f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Forall</span> v0 f0, <span style="color: #d3869b;">True</span>) <span style="color: #83a598;">=</span> [[(subst v0 nameT f0, <span style="color: #d3869b;">True</span>), f]]
  <span style="color: #fb4933;">where</span> nameT <span style="color: #83a598;">=</span> <span style="color: #d3869b;">N</span> (name 0)
          <span style="color: #fb4933;">where</span> name i <span style="color: #83a598;">=</span> <span style="color: #fb4933;">if</span> (subst v0 (<span style="color: #d3869b;">N</span> (<span style="color: #d3869b;">Name</span> i)) f0, <span style="color: #d3869b;">True</span>) <span style="color: #83a598;">`elem`</span> p
                         <span style="color: #fb4933;">then</span> name (i <span style="color: #83a598;">+</span> 1)
                         <span style="color: #fb4933;">else</span> <span style="color: #d3869b;">Name</span> i
<span style="color: #fabd2f;">gammaRule</span> p f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Exists</span> v0 f0, <span style="color: #d3869b;">False</span>) <span style="color: #83a598;">=</span> [[(subst v0 nameF f0, <span style="color: #d3869b;">False</span>), f]]
  <span style="color: #fb4933;">where</span> nameF <span style="color: #83a598;">=</span> <span style="color: #d3869b;">N</span> (name 0)
          <span style="color: #fb4933;">where</span> name i <span style="color: #83a598;">=</span> <span style="color: #fb4933;">if</span> (subst v0 (<span style="color: #d3869b;">N</span> (<span style="color: #d3869b;">Name</span> i)) f0, <span style="color: #d3869b;">False</span>) <span style="color: #83a598;">`elem`</span> p
                         <span style="color: #fb4933;">then</span> name (i <span style="color: #83a598;">+</span> 1)
                         <span style="color: #fb4933;">else</span> <span style="color: #d3869b;">Name</span> i
<span style="color: #fabd2f;">gammaRule</span> <span style="color: #fb4933;">_</span> f <span style="color: #83a598;">=</span> [[f]]
</pre>
</div>
</div>
</div>

<div id="outline-container-org040cce0" class="outline-3">
<h3 id="org040cce0"><span class="section-number-3">2.5.</span> δ rules</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">deltaRule</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Rule</span>
<span style="color: #fabd2f;">deltaRule</span> p f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Forall</span> v0 f0, <span style="color: #d3869b;">False</span>) <span style="color: #83a598;">=</span> [[(subst v0 frshnm f0, <span style="color: #d3869b;">False</span>), f]]
  <span style="color: #fb4933;">where</span> frshnm <span style="color: #83a598;">=</span> <span style="color: #d3869b;">N</span> (freshN (concatMap (ns <span style="color: #83a598;">.</span> fst) p))
<span style="color: #fabd2f;">deltaRule</span> p f<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Exists</span> v0 f0, <span style="color: #d3869b;">True</span>) <span style="color: #83a598;">=</span> [[(subst v0 frshnm f0, <span style="color: #d3869b;">True</span>), f]]
  <span style="color: #fb4933;">where</span> frshnm <span style="color: #83a598;">=</span> <span style="color: #d3869b;">N</span> (freshN (concatMap (ns <span style="color: #83a598;">.</span> fst) p))
<span style="color: #fabd2f;">deltaRule</span> <span style="color: #fb4933;">_</span> f <span style="color: #83a598;">=</span> [[f]]
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-11-13 Mon 16:08</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
